#include<stdio.h>

int main()
{
	//n的阶乘相当于从1*到n自己，用i代表每一步需要相乘的n，用m来储存i累乘的值，最后输出m。
	//1~n的阶乘相加则是先定义n的大小，d代表最终加成的结果，用i代表每一步需要相乘的n，
	//用m代表每一步需要相加的n的阶乘，用z表示分割相加和相乘运算的间隔。
	int m = 1, n = 10, i = 1, z = 1, d = 0;
	do
	{
		do
		{
			m = m * i;
			i++;
		} while (i <= z);
		d = d + m;
		z += 1;
	} while (z <= n);
	printf("%d\n", d);
	//有更好的方法：1！+2！+3！+4！= 1 + 1 * 2 + 1 * 2 * 3 + 1 * 2 * 3 * 4
	//可以发现最终=上一次终+累乘的积，所以：
	int w, q = 10, e = 1, r = 0;
	for (w = 1; w <= q; w++)
	{
		e = e * w;
		r = r + e;
	}
	printf("%d\n", r);
	return 0;
}